// Buff / Debuffs Database (Arabic)
const buffDebuffData = [
    {
        "name": "تعزيز الهجوم 4",
        "buff": "الهجوم +4%",
        "numbers": "atk_percent: 4"
    },
    {
        "name": "تعزيز الدفاع 4",
        "buff": "الدفاع +4%.",
        "numbers": "def_percent: 4"
    },
    {
        "name": "هجوم الضعف 1",
        "buff": "ضرر جسيم +6%.",
        "numbers": "crit_dmg: 6, general_dmg: 6"
    },
    {
        "name": "تعزيز القطع 1",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف لدرجة القطع +6%.",
        "numbers": "slashDmg: 6, general_dmg: 6"
    },
    {
        "name": "تعزيز التوجه 1",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف بالنسبة للدفع +6%.",
        "numbers": "thrustDmg: 6, general_dmg: 6"
    },
    {
        "name": "تعزيز بلانت 1",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف إلى حاد +6%.",
        "numbers": "bluntDmg: 6, general_dmg: 6"
    },
    {
        "name": "هجوم الضعف 2",
        "buff": "ضرر جسيم +12%.",
        "numbers": "crit_dmg: 12, general_dmg: 12"
    },
    {
        "name": "الثبات 4",
        "buff": "الدفاع +50% عندما تكون الصحة أقل من 25%.",
        "numbers": "def_percent: 50"
    },
    {
        "name": "التفاني 4",
        "buff": "الهجوم +20% عندما تزيد الصحة عن 75%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "تعزيز التوجه 4",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف بالنسبة للدفع +24%.",
        "numbers": "thrustDmg: 24, general_dmg: 24"
    },
    {
        "name": "تعزيز الهجوم 3",
        "buff": "الهجوم +4%.",
        "numbers": "atk_percent: 4"
    },
    {
        "name": "تعزيز الدفاع 2",
        "buff": "الدفاع +8%.",
        "numbers": "def_percent: 8"
    },
    {
        "name": "تعزيز الهجوم 2",
        "buff": "الهجوم +8%.",
        "numbers": "atk_percent: 8"
    },
    {
        "name": "تعزيز HP 2",
        "buff": "الصحة القصوى +8%.",
        "numbers": "hp_percent: 8"
    },
    {
        "name": "الثور الهائج 2",
        "buff": "الضرر +12% على الأعداء مع تحسين الهجوم.",
        "numbers": "general_dmg: 12"
    },
    {
        "name": "الفحل الهائج 2",
        "buff": "الضرر +12% على الأعداء مع تحسين الدفاع.",
        "numbers": "general_dmg: 12"
    },
    {
        "name": "تعزيز بلانت 4",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف إلى حاد +24%.",
        "numbers": "bluntDmg: 24, general_dmg: 24"
    },
    {
        "name": "ضربة حارقة 4",
        "buff": "الهجوم على الأعداء المحروقين يزيد بنسبة 24%.",
        "numbers": "general_dmg: 24"
    },
    {
        "name": "تعزيز القطع 4",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف لدرجة القطع +24%.",
        "numbers": "slashDmg: 24, general_dmg: 24"
    },
    {
        "name": "زغب الخطوة 4",
        "buff": "الدفاع + مع كل ضربة.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الضربة السامة 4",
        "buff": "الهجوم +24% على الأعداء المسمومين.",
        "numbers": "atk_percent: 24"
    },
    {
        "name": "الثبات 4",
        "buff": "قم بالهجوم بنسبة +20% عند أقل من 50% من نقاط الصحة الخاصة بك.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الثور الهائج 4",
        "buff": "الضرر +25% على الأعداء مع تحسين الهجوم.",
        "numbers": "general_dmg: 25"
    },
    {
        "name": "الفحل الهائج 4",
        "buff": "الضرر +25% على الأعداء مع تحسين الدفاع.",
        "numbers": "general_dmg: 25"
    },
    {
        "name": "حماية القطع 4",
        "buff": "تقليل الضرر الناتج عن وحش عنصر القطع المائل بنسبة 15%.",
        "numbers": "slashRes: 15"
    },
    {
        "name": "تعزيز الدفاع 3",
        "buff": "الدفاع +4%.",
        "numbers": "def_percent: 4"
    },
    {
        "name": "هدف النزيف القوي 4",
        "buff": "تزداد فرصة النزيف بشكل كبير. [تجاوز الهوامش الدقيقة 4] المعدل الحرج +24% عند تجاوز الهوامش.",
        "numbers": "crit_rate: 24"
    },
    {
        "name": "الضربة الدموية 4",
        "buff": "الهجوم +24% ضد الأعداء النازفين.",
        "numbers": "atk_percent: 24"
    },
    {
        "name": "هجوم الضعف 4",
        "buff": "ضرر جسيم +12%.",
        "numbers": "crit_dmg: 12, general_dmg: 12"
    },
    {
        "name": "خطوة في 4",
        "buff": "يزيد المعدل الحرج مع زيادة عدد الزيارات.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "حماية التوجه 4",
        "buff": "تقليل الضرر الناتج عن وحش عنصر الدفع بنسبة 15%.",
        "numbers": "thrustRes: 15"
    },
    {
        "name": "الإنعاش 4",
        "buff": "حيث أن HP أقل من 50% معدل حرج بزيادة 30%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "حماية حادة 4",
        "buff": "تقليل الضرر بنسبة 15% من وحوش العناصر الحادة. [تعزيز الدفاع 3] الدفاع +4%.",
        "numbers": "def_percent: 4"
    },
    {
        "name": "إرادة تشبه الفولاذ 4",
        "buff": "ينخفض الضرر إلى 20% عندما تكون الصحة 25% أو أقل. [تعزيز الدفاع 3] الدفاع +4%.",
        "numbers": "def_percent: 4"
    },
    {
        "name": "الهجوم الدقيق 3",
        "buff": "المعدل الحرج +10%.",
        "numbers": "crit_rate: 10"
    },
    {
        "name": "كامل من يوكي 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات Yuuki في نفس المجموعة، الدفاع +8%. عند تجهيز 5 أو أكثر من سجلات مهارات Yuuki في نفس المجموعة، الهجوم +8%.",
        "numbers": "def_percent: 8, atk_percent: 8"
    },
    {
        "name": "الهجوم الدقيق 4",
        "buff": "المعدل الحرج +10%.",
        "numbers": "crit_rate: 10"
    },
    {
        "name": "تعزيز HP 4",
        "buff": "زيادة الحد الأقصى للصحة 8%.",
        "numbers": "hp_percent: 8"
    },
    {
        "name": "إكسير العملاق",
        "buff": "عناصر الاسترداد والكائنات الموجودة في الحقول تقلل من معدل الاسترداد بنسبة 50% وستزيد الصحة القصوى بنسبة 30%.",
        "numbers": "hp_percent: 30"
    },
    {
        "name": "هدية زهرة 4",
        "buff": "عندما يتم شفاءك داخل الملعب بواسطة جسم ما، يزداد الهجوم والدفاع بنسبة 10%.",
        "numbers": "def_percent: 10"
    },
    {
        "name": "عطر الزهور 4",
        "buff": "يزيد التنشيط الحرج بنسبة 35% عندما تقوم بالشفاء باستخدام شيء ما في الحقل.",
        "numbers": "crit_rate: 35"
    },
    {
        "name": "تخلص من مخاوفك 4",
        "buff": "في حين أن الدفاع + التعزيز فعال، فإن قوة الهجوم ستزيد بنسبة 25%.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "السيطرة على الحشود 4",
        "buff": "الهجوم +8% تجاه العدو في أمراض الحالة (السم، الحرق، النزيف، قضمة الصقيع)، الضرر من العدو في أمراض الحالة (السم، الحرق، النزيف، قضمة الصقيع) -8%.",
        "numbers": "atk_percent: 8, allRes: 8"
    },
    {
        "name": "فرصة للهجوم 4",
        "buff": "ضرر جسيم للعدو +20% بينما تتناقص قوة هجوم العدو.",
        "numbers": "general_dmg: 20"
    },
    {
        "name": "فرصة للدفاع 4",
        "buff": "معدل التنشيط الحرج +20% بينما تتناقص القوة الدفاعية للعدو.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الروح القتالية 4",
        "buff": "في حين أن الهجوم الإيجابي + فعال، فإن الدفاع +25%.",
        "numbers": "def_percent: 25"
    },
    {
        "name": "التهرب 4",
        "buff": "معدل التهرب +10%. *لن يتم تفعيله بهجوم التركيز./â—[العداد 4] يضيف تعزيزًا عند التهرب، +10% معدل حرج لمدة 5 ثوانٍ.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "كسر الهجوم 4",
        "buff": "الهجوم +35% على الأعداء عند استخدام الاستراحة.",
        "numbers": "atk_percent: 35"
    },
    {
        "name": "استراحة التطويق 3",
        "buff": "زيادة مقياس الاختراق للعدو بنسبة +25%",
        "numbers": "break_pct: 25"
    },
    {
        "name": "مقاومة 4",
        "buff": "أمراض الحالة (السم، والحرق، والنزيف، وقضمة الصقيع) الدقة. +10%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الثبات 3",
        "buff": "الدفاع +10% عندما تكون الصحة أقل من 25%.",
        "numbers": "def_percent: 10"
    },
    {
        "name": "تعزيز بيرسيرك 4",
        "buff": "عندما يكون اللاعب في حالة مرضية (سم، حرق، نزيف، قضمة الصقيع، لعنة، ضعف)، الهجوم +25%./â—[تعزيز التخثر 4] ضرر النزيف -50%.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "حرق الهجوم الدقيق4",
        "buff": "المعدل الحرج +24% تجاه الخصوم المصابين بالحرق.",
        "numbers": "crit_rate: 24"
    },
    {
        "name": "التحول السريع 4",
        "buff": "قم بالهجوم بنسبة +10% لمدة 5 ثوانٍ عند حدوث التهرب.",
        "numbers": "atk_percent: 10"
    },
    {
        "name": "تعزيز HP 3",
        "buff": "زيادة الحد الأقصى للصحة 10%.",
        "numbers": "hp_percent: 10"
    },
    {
        "name": "التسارع 4",
        "buff": "ضرر جسيم +30% عندما تكون الصحة أقل من 50%.",
        "numbers": "crit_dmg: 30, general_dmg: 30"
    },
    {
        "name": "أمراض الحالة ضربة 4",
        "buff": "قم بالهجوم بنسبة +18% على العدو من خلال أمراض الحالة (السم، والحرق، والنزيف، وقضمة الصقيع).* التطور والحد الأقصى من الاختراق",
        "numbers": "atk_percent: 18"
    },
    {
        "name": "قنص 4",
        "buff": "مقدار الضرر +18% تجاه الوحوش التي لا تستهدف اللاعب.",
        "numbers": "general_dmg: 18"
    },
    {
        "name": "شفاء المعركة العالية 4",
        "buff": "يستعيد بحد أقصى 1.5% من الصحة في 3 ثوانٍ.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تعزيز القطع 3",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف لدرجة القطع +15%.",
        "numbers": "slashDmg: 15, general_dmg: 15"
    },
    {
        "name": "الجليدية بليد 3",
        "buff": "يسبب +5% من ضرر عنصر الماء للعدو.",
        "numbers": "waterDmg: 5"
    },
    {
        "name": "معجزة في ساحة المعركة 4",
        "buff": "الضرر الجسيم +25%، في حين أن زيادة معدل التعزيز الحرج تكون فعالة.",
        "numbers": "crit_dmg: 25, general_dmg: 25"
    },
    {
        "name": "تحويل اللهب 4",
        "buff": "ضرر عنصر الماء على الأعداء -10% وضرر عنصر النار على الأعداء +25%.",
        "numbers": "fireDmg: 25, general_dmg: 25"
    },
    {
        "name": "تحويل الأرض 4",
        "buff": "ضرر عنصر الرياح على الأعداء -10% وضرر عنصر الأرض على الأعداء +25%.",
        "numbers": "earthDmg: 25, general_dmg: 25"
    },
    {
        "name": "تقنية السيف المخضرم 4",
        "buff": "تزيد قوة الهجوم مع المستوى الخاص بنسبة 0.17%. (بحد أقصى 34%)/ â—[الحقيقة السوداء 4] ضرر إضافي 200 عند مهاجمة العدو بمرض الحالة (السم، والحرق، والنزيف، وقضمة الصقيع).",
        "numbers": "additionalDmg: 200"
    },
    {
        "name": "التحويل المائي 4",
        "buff": "ضرر عنصر النار على الأعداء -10% وضرر عنصر الماء على الأعداء +25%.",
        "numbers": "waterDmg: 25, general_dmg: 25"
    },
    {
        "name": "تحويل الرياح 4",
        "buff": "ضرر عنصر الأرض على الأعداء -10% وضرر عنصر الرياح على الأعداء +25%.",
        "numbers": "windDmg: 25, general_dmg: 25"
    },
    {
        "name": "فلاش أسود 4",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، المعدل الحرج +20%.",
        "numbers": "crit_rate: 20"
    },
    {
        "name": "معركة مشتركة سوداء 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، يزيد الضرر الجسيم بنسبة 15%.",
        "numbers": "crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "السيف الأسطوري الأسود 4",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، الهجوم +15%.",
        "numbers": "atk_percent: 15"
    },
    {
        "name": "القتال الأسود 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، معدل التهرب +5%. *لن يتم تفعيله بالهجوم البؤري.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الجنية السوداء 4",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، الحد الأقصى للصحة +22%.",
        "numbers": "hp_percent: 22"
    },
    {
        "name": "الحب الأسود 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، المعدل الحرج +15%.",
        "numbers": "crit_rate: 15"
    },
    {
        "name": "الحبل الأحمر 4",
        "buff": "الهجوم +10% أثناء تفعيل التعزيز الخاص بك.",
        "numbers": "atk_percent: 10"
    },
    {
        "name": "الوتر الأزرق 4",
        "buff": "الضرر +10% للعدو الذي يتناقص هجومه.",
        "numbers": "general_dmg: 10"
    },
    {
        "name": "الوتر الأخضر 4",
        "buff": "الضرر +10% للعدو الذي يتناقص دفاعه.",
        "numbers": "general_dmg: 10"
    },
    {
        "name": "تحويل اللمعان 4",
        "buff": "ضرر العنصر الداكن على الأعداء -10% وضرر العنصر المقدس على الأعداء +25%.",
        "numbers": "holyDmg: 25, general_dmg: 25"
    },
    {
        "name": "هناك قضية!",
        "buff": "ضرر جسيم +15%.",
        "numbers": "crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "هناك حقيقة واحدة فقط!",
        "buff": "الهجوم +20% للعدو الذي اكتشف نقطة ضعفه.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "عاصفة بليد 3",
        "buff": "يسبب +4.5% من ضرر عنصر الرياح للعدو.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "التأرجح الكامل 4",
        "buff": "المعدل الحرج +20% عندما تكون الصحة أعلى من 75%.",
        "numbers": "crit_rate: 20"
    },
    {
        "name": "عين القناص 4",
        "buff": "عندما تكون زيادة الضرر الجسيم فعالة بالنسبة لك، فإن المعدل الحرج +35%.",
        "numbers": "crit_rate: 35, general_dmg: 35"
    },
    {
        "name": "تمت إضافة العنصر",
        "buff": "يضيف العنصر المقدس إلى الهجوم العادي. (لا يتداخل تأثير العنصر المضاف، وسيتم تحديد أولوياته بترتيب الظلام، والمقدس، والأرض، والرياح، والماء، والنار)",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "فلاش بليد 4",
        "buff": "المعدل الحرج للهجوم العادي +35%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "نسيم 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، يزيد الضرر الجسيم بنسبة 15%.",
        "numbers": "crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "الزهرة المتفتحة 4",
        "buff": "عند الهجوم باستخدام 2 أو أكثر من سجلات المهارات الخاصة بـ \"Leafa\" المجهزة ضمن نفس المجموعة، تسبب ضررًا إضافيًا قدره 300.",
        "numbers": "additionalDmg: NaN"
    },
    {
        "name": "التعادل القاتل 4",
        "buff": "المعدل الحرج +50% عندما تكون الصحة أكبر من 99%.",
        "numbers": "crit_rate: 50"
    },
    {
        "name": "سيف التنين السري 4",
        "buff": "الهجوم +25% عندما تزيد الصحة عن 99%.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "قاتل ظل ضوء القمر 4",
        "buff": "الضرر الجسيم +38% عندما تكون الصحة أكبر من 99%.",
        "numbers": "crit_dmg: 38, general_dmg: 38"
    },
    {
        "name": "المشاعر الخفية 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Kirito في نفس المجموعة، المعدل الحرج +15%./â—[السماء التي رأيناها معًا 4] الهجوم +10% أثناء تأثير التعزيز الخاص بك./â—[تعزيز الشفاء 4] تأثير عناصر الشفاء والأشياء الميدانية +25%.",
        "numbers": "crit_rate: 15, atk_percent: 10"
    },
    {
        "name": "الأخت الكبرى! 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، الهجوم +10%",
        "numbers": "atk_percent: 10"
    },
    {
        "name": "أمنيتي 4",
        "buff": "عند التهرب، تتم إضافة تعزيز إضافي بمعدل +15% من المعدل الحرج والضرر البالغ لمدة 10 ثوانٍ.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "ضربة الصقيع 4",
        "buff": "الهجوم على الأعداء الذين يعانون من قضمة الصقيع يزيد بنسبة 20%.",
        "numbers": "general_dmg: 20"
    },
    {
        "name": "الجرس الذهبي 4",
        "buff": "أثناء تفعيل الضرر الإضافي الخاص بك، يصبح المعدل الحرج +20%.",
        "numbers": "additionalDmg: NaN, general_dmg: 20"
    },
    {
        "name": "سحر الضوء 4",
        "buff": "زيادة DEF مع مستواه الخاص - 0.17٪. (بحد أقصى 34%)",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الجليدية بليد 4",
        "buff": "يسبب +20% ضرر لعنصر الماء على العدو.",
        "numbers": "waterDmg: 20"
    },
    {
        "name": "الوعد 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، المعدل الحرج +20%.",
        "numbers": "crit_rate: 20"
    },
    {
        "name": "الملابس الجليدية 3",
        "buff": "عندما تصاب بقضمة الصقيع، الدفاع +10% والضرر الناتج عن قضمة الصقيع -15%.",
        "numbers": "def_percent: 10"
    },
    {
        "name": "الحلقة الجليدية 3",
        "buff": "عندما تصاب بقضمة الصقيع، يكون المعدل الحرج +20% وضرر قضمة الصقيع -15%.",
        "numbers": "crit_rate: 20"
    },
    {
        "name": "هامش الخبراء 4",
        "buff": "المعدل الحرج والضرر الفادح +12% عندما تكون الصحة أقل من 50%.",
        "numbers": "crit_dmg: 12, general_dmg: 12"
    },
    {
        "name": "نتائج التدريب الخاص 4",
        "buff": "يزيد المعدل الحرج حسب مستواك - 0.28٪. (الحد الأقصى 56%)",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الشجاعة 4",
        "buff": "قوة الهجوم +12% خلال تأثير التعزيز لزيادة الضرر الجسيم.",
        "numbers": "atk_percent: 12"
    },
    {
        "name": "4- الثقة المتذبذبة",
        "buff": "عندما يكون الضرر الحرج أقل من 10%، وإذا تم تجهيز 3 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، فسيكون هذا التأثير غير صالح.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "هجوم الضعف 3",
        "buff": "ضرر جسيم +25%.",
        "numbers": "crit_dmg: 25, general_dmg: 25"
    },
    {
        "name": "قلب متوتر 4",
        "buff": "عندما يكون المعدل الحرج أقل من 15%، إذا تم تجهيز 3 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، فسيكون هذا التأثير غير صالح.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "جندي متقدم 3",
        "buff": "الهجوم +300.",
        "numbers": "flat_atk: 300"
    },
    {
        "name": "تعزيز الترياق 5",
        "buff": "ضرر السم -70٪.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "مليئة بأسونا",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، الهجوم +10%. عند تجهيز 6 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، المعدل الحرج +20%.",
        "numbers": "atk_percent: 10, crit_rate: 20"
    },
    {
        "name": "تحدي العملاق 4",
        "buff": "أثناء تفعيل الضرر الإضافي الخاص بك، يصبح الهجوم +25%",
        "numbers": "additionalDmg: NaN, general_dmg: 25"
    },
    {
        "name": "تذكر 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، المعدل الحرج +30%.",
        "numbers": "crit_rate: 30"
    },
    {
        "name": "قاتل السمك 3",
        "buff": "إلحاق ضرر الرياح بالعدو بنسبة +10%.",
        "numbers": "windDmg: 10, general_dmg: 10"
    },
    {
        "name": "صوت نقي",
        "buff": "ضرر جسيم +20% عندما تزيد نقاط الصحة الخاصة بك عن 75%. [ابتسامة قاتلة] هجوم +20% للعدو الذي تم اكتشاف نقاط ضعفه.",
        "numbers": "crit_dmg: 20, general_dmg: 20, atk_percent: 20"
    },
    {
        "name": "لهب تنقية 4",
        "buff": "يسبب +22% ضرر لعنصر النار على العدو.",
        "numbers": "fireDmg: 22"
    },
    {
        "name": "أمر بالادين 4",
        "buff": "الهجوم +10%.",
        "numbers": "atk_percent: 10"
    },
    {
        "name": "هجوم الكسر 3",
        "buff": "الهجوم +25% على الأعداء عند استخدام الاستراحة.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "استراحة قصيرة 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، الهجوم +20%",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "4- أنفاس عظيمة",
        "buff": "عندما يتم شفاءك داخل الملعب بواسطة أحد الأغراض، يزداد الهجوم بنسبة 25%.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "قانون السماء والأرض 4",
        "buff": "عندما يتم شفاءك داخل الميدان بواسطة أحد الأغراض، تزيد مقاومة الحالة المرضية (الشلل، الصعق، النوم) بنسبة +100%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "استراحة قصيرة 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، الهجوم +20%",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "ابتسامة الشيطان 4",
        "buff": "ينخفض المعدل الحرج للهجمات غير العادية بنسبة 20%، ويزيد المعدل الحرج للهجمات العادية بنسبة 80%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "دعوة الظلام 4",
        "buff": "يسبب +22% من الضرر الذي يسببه عنصر الظلام للعدو.",
        "numbers": "darkDmg: 22"
    },
    {
        "name": "العيون الحاسمة 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Eugeo في نفس المجموعة، +300 ضرر إضافي عند الهجوم./â—[الهجوم 3] الهجوم +50.",
        "numbers": "additionalDmg: NaN, flat_atk: 50"
    },
    {
        "name": "قوة الإرادة 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Alice في نفس المجموعة، +300 ضرر إضافي عند الهجوم./â—[نذر الفارس 3] يتم استرداد الحد الأقصى من الصحة بنسبة 0.3% عند هزيمة الوحوش.",
        "numbers": "additionalDmg: NaN"
    },
    {
        "name": "قسم البقاء 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، الهجوم +15%. عند تجهيز 1 أو أكثر من سجلات مهارات السيليكا في نفس المجموعة، الحد الأقصى للصحة +10%. عند تجهيز 1 أو أكثر من سجلات مهارات Lisbeth في نفس المجموعة، الضرر البالغ +15%",
        "numbers": "atk_percent: 15, hp_percent: 10, crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "قوة الوحدة 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، يكون الضرر الذي يلحق بالأعداء ضعيفًا لدرجة القطع +10%. عند تجهيز 2 أو أكثر من سجلات مهارات Yuuki في نفس المجموعة، يكون الضرر الذي يلحق بالأعداء ضعيفًا لدرجة القطع +10%.",
        "numbers": "thrustDmg: 10, general_dmg: 20, slashDmg: 10"
    },
    {
        "name": "نسيم 3",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، يزيد الضرر الجسيم بنسبة 15%.",
        "numbers": "crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "الرقص الأرضي 4",
        "buff": "تسبب +22% من ضرر عنصر الأرض للعدو./â—[المطرقة 3] تسبب 1000 ضرر إضافي ضد الأعداء بحالة التحسين (العلامة، العلامة الصغيرة، علامة الموت، علامة تآكل الدفع، علامة التدمير المائلة).",
        "numbers": "earthDmg: 22, additionalDmg: NaN"
    },
    {
        "name": "رقص خفيف 4",
        "buff": "يسبب +22% ضرر للعنصر المقدس على العدو./â—[الإخلاص 3] الهجوم +10% عندما تكون الصحة أكبر من 75%.",
        "numbers": "holyDmg: 22, atk_percent: 10"
    },
    {
        "name": "تخلص من خوفك 3",
        "buff": "في حين أن الدفاع + التعزيز فعال، فإن قوة الهجوم ستزيد بنسبة 15%./â—[MHCP 3] الضرر الإضافي +200 عند الهجوم.",
        "numbers": "atk_percent: 15, additionalDmg: NaN"
    },
    {
        "name": "لاحظني سينباي 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Eugeo في نفس المجموعة، الهجوم +12%./â—[سوف يستمر 4] أثناء تأثير تعزيز الضرر الإضافي الخاص بك، الضرر الإضافي +1000 عند الهجوم.",
        "numbers": "atk_percent: 12, additionalDmg: NaN"
    },
    {
        "name": "تقنية السيف المخضرم 3",
        "buff": "تزيد قوة الهجوم مع المستوى الخاص بنسبة 0.12%. (الحد الأقصى 24%)",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "هدية الابتسامة 4",
        "buff": "يستعيد 3% من الحد الأقصى من الصحة لديك عند الضربة الحرجة. (مرة واحدة لكل مهارة)* التطور والحد الأقصى من الاختراق",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "العداد 5",
        "buff": "يضيف تعزيزًا عند المراوغة، +30% معدل حرج لمدة 8 ثوانٍ.* التطور والحد الأقصى للاختراق",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الوقوف 5",
        "buff": "مقاومة الارتعاش +60% عندما تزيد الصحة عن 75%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تيمبو يصل 5",
        "buff": "يزداد الهجوم مع عدد الضربات.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "خطوة في 5",
        "buff": "يزيد المعدل الحرج مع زيادة عدد الزيارات.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الهيمنة السوداء",
        "buff": "الهجوم +15% عند عدم تجهيز أي من سجلات مهارات أليس في نفس المجموعة.",
        "numbers": "atk_percent: 15"
    },
    {
        "name": "تحويل الظلام 4",
        "buff": "ضرر العنصر المقدس على الأعداء -10% وضرر العنصر المظلم على الأعداء +25%.",
        "numbers": "darkDmg: 25, general_dmg: 25"
    },
    {
        "name": "معركة بكل سهولة 4",
        "buff": "الهجوم +25% بينما التعزيز الذي يستعيد الصحة تدريجيًا اعتمادًا على سجل المهارة ساري المفعول./â—[تعزيز الهجوم الدقيق 3] المعدل الحرج +15% بينما التعزيز لرفع المعدل الحرج ساري المفعول.* التطور والحد الأقصى للاختراق",
        "numbers": "atk_percent: 25, crit_rate: 15"
    },
    {
        "name": "الاندفاع المتهور 4",
        "buff": "قم بالهجوم بنسبة +25% أثناء تأثير التعزيز الذي يزيد من مقاومة تراجعك./â—[Breaking Fist 3] المعدل الحرج +15% أثناء تأثير تعزيز الضرر الإضافي الخاص بك.",
        "numbers": "atk_percent: 25, crit_rate: 15, additionalDmg: NaN"
    },
    {
        "name": "العبها عن طريق الأذن 4",
        "buff": "الهجوم +10% عندما تكون الصحة أعلى من 50%، والدفاع +10% عندما تكون الصحة أقل من 50%.",
        "numbers": "atk_percent: 10, def_percent: 10"
    },
    {
        "name": "تعزيز القطع 2",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف لدرجة القطع +10%.",
        "numbers": "slashDmg: 10, general_dmg: 10"
    },
    {
        "name": "تعزيز التوجه 2",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف بالنسبة للدفع +10%.",
        "numbers": "thrustDmg: 10, general_dmg: 10"
    },
    {
        "name": "تعزيز بلانت 2",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف إلى حاد +10%.",
        "numbers": "bluntDmg: 10, general_dmg: 10"
    },
    {
        "name": "ووف ووف!",
        "buff": "قم بالهجوم بنسبة +18% على الأعداء بتأثير برتقالي ويقلل الضرر بنسبة 10%.",
        "numbers": "atk_percent: 18"
    },
    {
        "name": "نحن توأمان!",
        "buff": "المعدل الحرج +20% ضد الأعداء بتأثير برتقالي، والضرر الحرج +20%.",
        "numbers": "crit_rate: 20, crit_dmg: 20, general_dmg: 20"
    },
    {
        "name": "معالجة البيانات 4",
        "buff": "ضرر جسيم +20% للأعداء ذوي حالة التحسين.",
        "numbers": "crit_dmg: 20, general_dmg: 20"
    },
    {
        "name": "معالجة البيانات 3",
        "buff": "ضرر جسيم +15% ضد الأعداء ذوي حالة التحسين.",
        "numbers": "crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "حماية القطع 3",
        "buff": "تقليل الضرر الناتج عن وحش عنصر القطع المائل بنسبة 12%.",
        "numbers": "slashRes: 12"
    },
    {
        "name": "لصوص القلوب الوهمية: النمر",
        "buff": "ضرر إضافي +1000 عند تجهيز 2 أو أكثر من سجلات المهارات لأي من الشخصيات الجوكر/الجمجمة/النمر/منى/الثعلب/الملكة/نوير/بنفسجي في نفس المجموعة.",
        "numbers": "additionalDmg: NaN"
    },
    {
        "name": "لصوص القلوب الوهميون: منى",
        "buff": "ضرر إضافي +500 عند تجهيز 2 أو أكثر من سجلات المهارات لأي من الشخصيات الجوكر/الجمجمة/النمر/منى/الثعلب/الملكة/نوير/بنفسجي في نفس المجموعة.",
        "numbers": "additionalDmg: NaN"
    },
    {
        "name": "لصوص القلوب الوهمية: الملكة",
        "buff": "ضرر إضافي +1000 عند تجهيز 2 أو أكثر من سجلات المهارات لأي من الشخصيات الجوكر/الجمجمة/النمر/منى/الثعلب/الملكة/نوير/بنفسجي في نفس المجموعة.",
        "numbers": "additionalDmg: NaN"
    },
    {
        "name": "ارتفاع الطاقة 3",
        "buff": "الهجوم +800.",
        "numbers": "flat_atk: 800"
    },
    {
        "name": "القلب المتعاطف: ليفا",
        "buff": "ضرر جسيم +15% عند تجهيز 1 أو أكثر من سجلات المهارات لأي من الشخصيات الجوكر/الجمجمة/النمر/منى/الثعلب/الملكة/نوير/بنفسجي في نفس المجموعة.",
        "numbers": "crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "القلب المتعاطف: يوكي",
        "buff": "المعدل الحرج +15% عند تجهيز 1 أو أكثر من سجلات المهارة لأي من الشخصيات الجوكر/الجمجمة/النمر/منى/الثعلب/الملكة/نوير/بنفسجي في نفس المجموعة.",
        "numbers": "crit_rate: 15"
    },
    {
        "name": "القلب التعاطف: أليس",
        "buff": "الهجوم +15% عند تجهيز 1 أو أكثر من سجلات المهارات لأي من الشخصيات الجوكر/الجمجمة/النمر/منى/الثعلب/الملكة/نوير/بنفسجي في نفس المجموعة.",
        "numbers": "atk_percent: 15"
    },
    {
        "name": "عاصفة بليد 4",
        "buff": "يسبب +20% من ضرر عنصر الرياح للعدو.",
        "numbers": "windDmg: 20"
    },
    {
        "name": "الحفظ التلقائي 4",
        "buff": "الدفاع +25% عند حدوث أمراض مثل الشلل، والصعق، والنوم، واللعنة، والوهن، والتحجر، والتسمم، والحرق، والنزيف، وقضمة الصقيع.",
        "numbers": "def_percent: 25"
    },
    {
        "name": "تحول المواهب 1",
        "buff": "يتغير التأثير وفقًا لسجلات المهارات الموجودة في نفس المجموعة. يستعيد 70 نقطة صحة كل 3 ثوانٍ عند تجهيز 1 أو أكثر من سجلات مهارات أليس في نفس المجموعة. الهجوم +20% عند عدم تجهيز أليس بسجلات المهارات في نفس المجموعة.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "تعزيز بلانت 3",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف إلى حاد +15%.",
        "numbers": "bluntDmg: 15, general_dmg: 15"
    },
    {
        "name": "ارتفاع معركة الشفاء 3",
        "buff": "يستعيد بحد أقصى 1.2% من الصحة في 3 ثوانٍ.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الطعنة الخلفية 4",
        "buff": "الضرر +18% تجاه الوحوش غير المستهدفة للاعب.",
        "numbers": "general_dmg: 18"
    },
    {
        "name": "الهيمنة المظلمة",
        "buff": "ضرر إضافي +1000 عند عدم تجهيز أي من سجلات مهارات أليس في نفس المجموعة.",
        "numbers": "additionalDmg: NaN"
    },
    {
        "name": "ضربة الصقيع 3",
        "buff": "الهجوم على الأعداء الذين يعانون من قضمة الصقيع يزيد بنسبة 18%.",
        "numbers": "general_dmg: 18"
    },
    {
        "name": "معركة من أجل العدالة",
        "buff": "مقاومة التراجع +80% عندما تصل الصحة إلى 100%. يستعيد بحد أقصى 1% من الصحة لكل 3 ثوانٍ عندما تنخفض الصحة إلى أقل من 99%.",
        "numbers": "hp_regen: 1"
    },
    {
        "name": "أمراض الحالة ضربة 3",
        "buff": "الهجوم +18% ضد العدو المصاب بأمراض الحالة (السم، الحرق، النزيف، قضمة الصقيع)./ â—[العين اليسرى للتنين] ضرر إضافي +1000.",
        "numbers": "atk_percent: 18, additionalDmg: NaN"
    },
    {
        "name": "الموافقة الحيوية 3",
        "buff": "الدفاع +400.",
        "numbers": "flat_def: 400"
    },
    {
        "name": "لون الروح",
        "buff": "يتغير التأثير وفقًا لسجلات المهارة في نفس المجموعة. عند تجهيز 1 أو أكثر من سجلات مهارة Asuna: الحد الأقصى للصحة +10%. عند تجهيز 1 أو أكثر من سجلات مهارة Sinon: الهجوم +20%. عند تجهيز 1 أو أكثر من سجلات مهارة Leafa: ضرر إضافي +500. عند تجهيز 1 أو أكثر من سجلات مهارة Alice: المعدل الحرج +10%. عند تجهيز 1 أو أكثر من سجلات مهارة Eugeo: ضرر جسيم +10%.",
        "numbers": "hp_percent: 10, atk_percent: 20, additionalDmg: NaN, crit_rate: 10, crit_dmg: 10, general_dmg: 10"
    },
    {
        "name": "دعوة الظلام 3",
        "buff": "يسبب +15% من الضرر الذي يلحقه عنصر الظلام بالعدو.",
        "numbers": "darkDmg: 15"
    },
    {
        "name": "التعلم التلقائي 4",
        "buff": "تضيف تأثيرات إضافية بناءً على عدد سجلات مهارات أليس المجهزة في نفس المجموعة.2 أو أكثر: الدفاع +5%.3 أو أكثر: الحد الأقصى للصحة +10%.4 أو أكثر: المعدل الحرج +15%.5 أو أكثر: الضرر الخطير +15%.6 أو أكثر: الهجوم +20%.",
        "numbers": "def_percent: 5, hp_percent: 10, crit_rate: 15, crit_dmg: 15, general_dmg: 15, atk_percent: 20"
    },
    {
        "name": "كامل من أليس 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات أليس في نفس المجموعة، الدفاع +10%. عند تجهيز 6 أو أكثر من سجلات مهارات أليس في نفس المجموعة، يزداد الضرر الجسيم بنسبة 20%.",
        "numbers": "def_percent: 10, crit_dmg: 20, general_dmg: 20"
    },
    {
        "name": "تحول المواهب 2",
        "buff": "يتغير التأثير اعتمادًا على سجلات المهارة في نفس المجموعة. ضرر إضافي +1000 عند تجهيز 1 أو أكثر من سجلات مهارة أليس في نفس المجموعة. الهجوم +20% عند عدم تجهيز سجلات مهارة أليس في نفس المجموعة.",
        "numbers": "additionalDmg: NaN, atk_percent: 20"
    },
    {
        "name": "وتر الضوء 4",
        "buff": "ضرر العنصر المقدس +28% للأعداء الذين لديهم تأثير برتقالي.",
        "numbers": "holyDmg: 28, general_dmg: 28"
    },
    {
        "name": "حلم التعاون",
        "buff": "يزيد الهجوم بمقدار 150 ضعف عدد سجلات مهارات Yuna في نفس المجموعة.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "وتر الظلام 4",
        "buff": "ضرر العنصر الداكن +28% للأعداء الذين لديهم تأثير برتقالي.",
        "numbers": "darkDmg: 28, general_dmg: 28"
    },
    {
        "name": "جندي متقدم 4",
        "buff": "الهجوم +400.",
        "numbers": "flat_atk: 400"
    },
    {
        "name": "تعويض الأرض 3",
        "buff": "عندما تتسمم، ضرر العنصر الأرضي +40%./â—[تعزيز الترياق 3] ضرر السم -30%.",
        "numbers": "earthDmg: 40, general_dmg: 40"
    },
    {
        "name": "تعزيز التوجه 3",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف بالنسبة للدفع بنسبة +15%.",
        "numbers": "thrustDmg: 15, general_dmg: 15"
    },
    {
        "name": "الرقص الأرضي 2",
        "buff": "يسبب +9.3% من ضرر عنصر الأرض للعدو.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تعزيز هجوم الضعف 3",
        "buff": "الضرر الجسيم +15% أثناء تفعيل التعزيز لرفع الضرر الجسيم.* التطور والحد الأقصى من الاختراق",
        "numbers": "crit_dmg: 15, general_dmg: 15"
    },
    {
        "name": "تحول المواهب 3",
        "buff": "يتغير التأثير اعتمادًا على سجلات المهارة في نفس المجموعة. المبلغ الذي يتم شفاءه بواسطة النباتات +10% عند تجهيز 1 أو أكثر من سجلات مهارات أليس في نفس المجموعة. الهجوم +20% عند تجهيز أي سجلات مهارات أليس في نفس المجموعة.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "4- محبة الأخت",
        "buff": "يرتفع الضرر الجسيم بنسبة 5% × عدد سجلات مهارات Leafa في نفس المجموعة. ويرتفع الهجوم بنسبة 6% × عدد سجلات مهارات السيليكا في نفس المجموعة.",
        "numbers": "atk_percent: 6"
    },
    {
        "name": "تعويض اللهب 3",
        "buff": "عندما تحترق، ضرر عنصر النار + 40%./â—[تعزيز مناعة الحروق 3] ضرر الحروق -30%.",
        "numbers": "fireDmg: 40, general_dmg: 40"
    },
    {
        "name": "تعزيز بيرسيرك 3",
        "buff": "عندما يعاني اللاعب من أمراض الحالة (السم، والحرق، والنزيف، وقضمة الصقيع، واللعنة، والوهن)، والهجوم +20%.* التطور والحد الأقصى من الاختراق",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "جندي متقدم 5",
        "buff": "الهجوم +500.",
        "numbers": "flat_atk: 500"
    },
    {
        "name": "خمسة أسلحة حادة 3",
        "buff": "الهجوم +800 عند الهجوم بعنصر الدفع.",
        "numbers": "flat_atk: 800"
    },
    {
        "name": "امسك الجبهة 4",
        "buff": "يستعيد حدًا أقصى قدره 5%+200 من الصحة لكل 3 ثوانٍ عندما تكون الصحة أقل من 50%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "ضربة حارقة 3",
        "buff": "الهجوم على الأعداء المحروقين يزيد بنسبة 18%.",
        "numbers": "general_dmg: 18"
    },
    {
        "name": "ارتفاع الطاقة 4",
        "buff": "الهجوم +900.",
        "numbers": "flat_atk: 900"
    },
    {
        "name": "الجليد الرقيق 4",
        "buff": "الدفاع -30% وأثناء تأثير التحسين لزيادة الحد الأقصى من الصحة -99% كل 3 ثوانٍ.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الجليدية بليد 2",
        "buff": "يسبب +9.3% ضرر لعنصر الماء على العدو.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "معركة بكل سهولة 3",
        "buff": "الهجوم +20% بينما التعزيز الذي يستعيد الصحة تدريجيًا اعتمادًا على سجل المهارة ساري المفعول./â—[تعزيز الشفاء 4] تأثير عناصر الشفاء والأشياء الميدانية +25%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "موثوق إخوانه 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Leafa في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "التهرب 3",
        "buff": "معدل التهرب +7.2%. *لن يتم تفعيله بالهجوم البؤري.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "ضربة مطرقة 4",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف إلى حاد +30% ضد الأعداء ذوي حالة التحسين (العلامة، العلامة الصغيرة، علامة الموت، علامة تآكل الدفع، علامة التدمير المائلة).",
        "numbers": "bluntDmg: 30, general_dmg: 30"
    },
    {
        "name": "الثور الهائج 3",
        "buff": "الضرر +18% على الأعداء مع تحسين الهجوم.",
        "numbers": "general_dmg: 18"
    },
    {
        "name": "الفحل الهائج 3",
        "buff": "الضرر +18% على الأعداء مع تحسين الدفاع.",
        "numbers": "general_dmg: 18"
    },
    {
        "name": "ارتفاع روح السيف 4",
        "buff": "يرتفع الهجوم بنسبة 3.5% x عدد سجلات مهارات Yuuki في نفس المجموعة.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "نشيطة 4",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات Agil في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "عاصفة بليد 2",
        "buff": "يسبب +9.3% ضرر عنصر الرياح للعدو.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "التسارع 3",
        "buff": "ضرر جسيم +20% عندما تكون الصحة أقل من 50%.",
        "numbers": "crit_dmg: 20, general_dmg: 20"
    },
    {
        "name": "ضربة المعركة الدموية 3",
        "buff": "الهجوم +35% عند الهجوم بعنصر حاد.",
        "numbers": "atk_percent: 35"
    },
    {
        "name": "الناب الفولاذي 4",
        "buff": "الهجوم +500 عند الهجوم بعنصر الدفع.",
        "numbers": "flat_atk: 500"
    },
    {
        "name": "تعزيز اللهب 4",
        "buff": "الضرر العنصري غير النار الذي يلحق بالأعداء -50%، والضرر الذي تسببه العناصر النارية للأعداء +40%.",
        "numbers": "waterDmg: -50, windDmg: -50, earthDmg: -50, holyDmg: -50, darkDmg: -50, noneDmg: -50, fireDmg: 40, general_dmg: 40"
    },
    {
        "name": "حكم السيف الأسطوري",
        "buff": "قم بالهجوم +20% عند عدم تجهيز أي من سجلات مهارات كيريتو في نفس المجموعة.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "تحويل اللهب 3",
        "buff": "ضرر عنصر الماء على الأعداء -10% وضرر عنصر النار على الأعداء +20%.",
        "numbers": "fireDmg: 20, general_dmg: 20"
    },
    {
        "name": "لقاء صديق",
        "buff": "يستعيد 80 نقطة صحة كل 3 ثوانٍ عند تجهيز 3 أو أكثر من سجلات مهارات Asuna في نفس المجموعة.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "من النوع 4",
        "buff": "الدفاع -30% وأثناء تأثير التعزيز لزيادة الحد الأقصى من الصحة، والهجوم والضرر -99% عند استخدام الهجوم العادي.* التطور والحد الأقصى للاختراق",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "إله البحر 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات Sinon في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الرقص الأرضي 5",
        "buff": "يسبب +25% من ضرر عنصر الأرض للعدو.",
        "numbers": "earthDmg: 25"
    },
    {
        "name": "تحول المواهب 4",
        "buff": "يتغير التأثير وفقًا لسجلات المهارات في نفس المجموعة. عند تجهيز 1 أو أكثر من سجلات مهارات Kirito في نفس المجموعة، + معدل نجاح الحرق. الضرر الذي يلحق بالأعداء ضعيف لدرجة القطع +30% عند عدم تجهيز Kirito بسجلات مهارات في نفس المجموعة.",
        "numbers": "slashDmg: 30, general_dmg: 30"
    },
    {
        "name": "الكل باللون الأسود 4",
        "buff": "يضيف تأثيرات إضافية بناءً على عدد سجلات مهارات Kirito المجهزة في نفس المجموعة.2 أو أكثر: يستعيد بحد أقصى 1.2% من الصحة لكل 3 ثوانٍ.3 أو أكثر: الحد الأقصى من الصحة +5%.4 أو أكثر: المعدل الحرج +10%.5 أو أكثر: الضرر الخطير +10%.6 أو أكثر: الهجوم +15%.",
        "numbers": "hp_percent: 5, crit_rate: 10, crit_dmg: 10, general_dmg: 10, atk_percent: 15"
    },
    {
        "name": "الضربة الدموية 3",
        "buff": "الهجوم +18% ضد الأعداء النازفين.",
        "numbers": "atk_percent: 18"
    },
    {
        "name": "المزيد ديبان 1",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات ليزبث في نفس المجموعة، الهجوم +20%",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الحفظ التلقائي 2",
        "buff": "الدفاع +15% عند الإصابة بأمراض مثل الشلل، والصعق، والنوم، واللعنة، والوهن، والتحجر، والتسمم، والحرق، والنزيف، وقضمة الصقيع.",
        "numbers": "def_percent: 15"
    },
    {
        "name": "تعويض الضوء 3",
        "buff": "عندما تصبح ضعيفًا، يزيد ضرر العنصر المقدس بنسبة 40%.",
        "numbers": "holyDmg: 40, general_dmg: 40"
    },
    {
        "name": "4-القبضة الحديدية",
        "buff": "الهجوم +500 عند الهجوم بعنصر حاد.",
        "numbers": "flat_atk: 500"
    },
    {
        "name": "ملك الصولجانات 3",
        "buff": "قم بالهجوم +1000 عندما يتم تجهيز نادي 1H",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "التمرد على النظام 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، الهجوم +20%",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "التكتيكات الخام 2",
        "buff": "الدفاع -30%، وعندما تكون الصحة أقل من 50%، الضرر غير العنصري -400%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تعزيز الرياح 4",
        "buff": "ضرر العناصر بخلاف الرياح الذي يلحق بالأعداء -50%، وضرر عنصر الرياح على الأعداء +40%.",
        "numbers": "fireDmg: -50, waterDmg: -50, earthDmg: -50, holyDmg: -50, darkDmg: -50, noneDmg: -50, windDmg: 40, general_dmg: 40"
    },
    {
        "name": "النمر الأسود 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Sachi في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "تعزيز الظلام 4",
        "buff": "ضرر العناصر بخلاف اللون الداكن يلحق بالأعداء -50%، وضرر العنصر الداكن على الأعداء +40%.",
        "numbers": "fireDmg: -50, waterDmg: -50, windDmg: -50, earthDmg: -50, holyDmg: -50, noneDmg: -50, darkDmg: 40, general_dmg: 40"
    },
    {
        "name": "التحول إلى المشاجرة 4",
        "buff": "الهجوم +20% عند عدم تجهيز أي من سجلات مهارات Sinon في نفس المجموعة.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "المزيد ديبان 2",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Silica في نفس المجموعة، الهجوم +20%",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "تعويض الظل 3",
        "buff": "عندما تتعرض للعنة، ضرر العنصر الداكن +40%.",
        "numbers": "darkDmg: 40, general_dmg: 40"
    },
    {
        "name": "مكافحة اللعنة 4",
        "buff": "عندما يكون اللاعب في حالة مرضية (لعنة)، الهجوم +1500.",
        "numbers": "flat_atk: 1500"
    },
    {
        "name": "الهجوم 4",
        "buff": "الهجوم +25%.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "تعويض الجليد 3",
        "buff": "عندما تتعرض لقضمة الصقيع، فإن ضرر عنصر الماء +40%./â—[تعزيز قضمة الصقيع 3] ضرر قضمة الصقيع -30%.",
        "numbers": "waterDmg: 40, general_dmg: 40"
    },
    {
        "name": "تأثير السحق 3",
        "buff": "الهجوم +800 عند الهجوم بعنصر حاد.",
        "numbers": "flat_atk: 800"
    },
    {
        "name": "أكوا بوست 4",
        "buff": "ضرر العناصر بخلاف الماء الذي يلحق بالأعداء -50%، وضرر عنصر الماء على الأعداء +40%.",
        "numbers": "fireDmg: -50, windDmg: -50, earthDmg: -50, holyDmg: -50, darkDmg: -50, noneDmg: -50, waterDmg: 40, general_dmg: 40"
    },
    {
        "name": "الحفظ التلقائي 3",
        "buff": "الدفاع +20% عند حدوث أمراض مثل الشلل، والصعق، والنوم، واللعنة، والوهن، والتحجر، والتسمم، والحرق، والنزيف، وقضمة الصقيع.",
        "numbers": "def_percent: 20"
    },
    {
        "name": "تزدهر 4",
        "buff": "الهجوم +20% عندما تزيد الصحة عن 50%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "ضربة الصقيع 5",
        "buff": "الهجوم على الأعداء الذين يعانون من قضمة الصقيع يزيد بنسبة 30%.",
        "numbers": "general_dmg: 30"
    },
    {
        "name": "التجسد: القوة 4",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات أليس في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الموافقة الحيوية 4",
        "buff": "الدفاع +450.",
        "numbers": "flat_def: 450"
    },
    {
        "name": "تعزيز الهجوم 5",
        "buff": "الهجوم +18%.",
        "numbers": "atk_percent: 18"
    },
    {
        "name": "سريع وسهل",
        "buff": "يقلل من مقاومة الانزلاق بنسبة 100%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "مثيرة 4",
        "buff": "الدفاع -30% والأضرار الجسيمة -300% أثناء تأثير التعزيز لزيادة الحد الأقصى من الصحة.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تنقية اللهب 3",
        "buff": "يسبب +15% من ضرر عنصر النار للعدو.",
        "numbers": "fireDmg: 15"
    },
    {
        "name": "القلب المضاد 3",
        "buff": "قم بالهجوم +18% على الأعداء الذين لديهم تأثير برتقالي",
        "numbers": "atk_percent: 18"
    },
    {
        "name": "رنين اللهب 4",
        "buff": "ضرر عنصر النار +30% للأعداء الذين لديهم تأثير برتقالي.",
        "numbers": "fireDmg: 30, general_dmg: 30"
    },
    {
        "name": "ملك سبيرز 3",
        "buff": "قم بالهجوم +1000 عند استخدام الرمح 2H.",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "تعزيز التألق 4",
        "buff": "ضرر العناصر غير المقدسة يلحق بالأعداء -50%، وضرر العنصر المقدس يلحق بالأعداء +40%.",
        "numbers": "fireDmg: -50, waterDmg: -50, windDmg: -50, earthDmg: -50, darkDmg: -50, noneDmg: -50, holyDmg: 40, general_dmg: 40"
    },
    {
        "name": "نتائج التدريب 4",
        "buff": "يزداد الضرر الجسيم بمستواك À 0.14% (بحد أقصى 28%)",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "ستة مسارات 4",
        "buff": "يتغير التأثير وفقًا لسجلات المهارة في نفس المجموعة. عند تجهيز 2 من سجلات مهارات كيريتو: يسبب +40% من ضرر عنصر الأرض للعدو. عند تجهيز 3 من سجلات مهارات كيريتو: يسبب +40% من ضرر عنصر الرياح للعدو. عند تجهيز 4 من سجلات مهارات كيريتو: يسبب +40% من ضرر عنصر النار للعدو. عند تجهيز 5 من سجلات مهارات كيريتو: يسبب +40% من ضرر عنصر الماء للعدو. عند تجهيز 6 من سجلات مهارات كيريتو: يسبب +50% من ضرر العنصر المقدس للعدو. عند تجهيز 7 من سجلات مهارات كيريتو: يسبب +50% من ضرر العنصر الداكن للعدو.",
        "numbers": "earthDmg: 40, windDmg: 40, fireDmg: 40, waterDmg: 40, holyDmg: 50, darkDmg: 50"
    },
    {
        "name": "صديق أجنبي 1",
        "buff": "يزيد الهجوم بمقدار 200 ضعف عدد سجلات مهارة المطر في نفس المجموعة.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "شفط الحرارة 3",
        "buff": "عندما يكون اللاعب في حالة مرضية (حرق)، الهجوم +40%./â—[تعزيز مناعة الحرق 3] ضرر الحرق -30%.",
        "numbers": "atk_percent: 40"
    },
    {
        "name": "معلومات الفئران 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Argo في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الهجوم الأمامي 4",
        "buff": "زيادة العدوانية -40% عند وقوع الهجوم",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "المرونة 4",
        "buff": "مقاومة التحجر +80% عندما تصل الصحة إلى 100%. يستعيد بحد أقصى 1% من الصحة لكل 3 ثوانٍ عندما تنخفض الصحة إلى أقل من 99%.",
        "numbers": "hp_regen: 1"
    },
    {
        "name": "ملك المحاور 3",
        "buff": "قم بالهجوم +1000 عند استخدام الفأس 2H.",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "حماية التوجه 3",
        "buff": "تقليل الضرر الناتج عن وحش عنصر الدفع بنسبة 12%.",
        "numbers": "thrustRes: 12"
    },
    {
        "name": "التعلم التلقائي 5",
        "buff": "تضيف تأثيرات إضافية بناءً على عدد سجلات مهارات أليس المجهزة في نفس المجموعة.2 أو أكثر: المعدل الحرج +20%.3 أو أكثر: الدفاع +5%.4 أو أكثر: الحد الأقصى للصحة +10%.5 أو أكثر: الضرر الخطير +20%.6 أو أكثر: الهجوم +35%.",
        "numbers": "crit_rate: 20, def_percent: 5, hp_percent: 10, crit_dmg: 20, general_dmg: 20, atk_percent: 35"
    },
    {
        "name": "سوبر محظوظ!",
        "buff": "هناك فرصة بنسبة 1% أن يؤدي الهجوم التالي الذي يتلقاه العدو إلى إحداث ضرر بمقدار 2.5x. (ينطبق على هجمات أعضاء الطرف الآخرين. وسيختفي التأثير بعد 10 ثوانٍ إذا لم يتم تفعيله.)",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "محظوظ!",
        "buff": "فرصة 25% للمعدل الحرج +50% لمدة 10 ثوانٍ.",
        "numbers": "crit_rate: 50"
    },
    {
        "name": "الحظ غير المؤكد!",
        "buff": "فرصة الهجوم 75% +7% لمدة 30 ثانية.",
        "numbers": "atk_percent: 7"
    },
    {
        "name": "اه اه!",
        "buff": "فرصة 5% لإلحاق اللعنة على نفسك لمدة 20 ثانية.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تعزيز الأرض 4",
        "buff": "ضرر العناصر بخلاف الأرض يلحق بالأعداء -50%، وضرر عنصر الأرض على الأعداء +40%.",
        "numbers": "fireDmg: -50, waterDmg: -50, windDmg: -50, holyDmg: -50, darkDmg: -50, noneDmg: -50, earthDmg: 40, general_dmg: 40"
    },
    {
        "name": "تحول المواهب 5",
        "buff": "يتغير التأثير اعتمادًا على سجلات المهارة في نفس المجموعة. عند تجهيز 1 أو أكثر من سجلات مهارات Kirito في نفس المجموعة، + معدل نجاح قضمة الصقيع. الهجوم +20% عند عدم تجهيز أي سجلات مهارات Kirito في نفس المجموعة.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "عامل المسرح 4",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات Koharu في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "تعويض الظل 1",
        "buff": "عندما تتعرض للعنة، ضرر العنصر المظلم +25%.",
        "numbers": "darkDmg: 25, general_dmg: 25"
    },
    {
        "name": "ملك الخناجر 3",
        "buff": "قم بالهجوم +1000 عند استخدام الخناجر.",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "زهرة الثلج 4",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات Eugeo في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "معركة دامية القطع 3",
        "buff": "الهجوم +35% عند الهجوم بعنصر الشرطة المائلة.",
        "numbers": "atk_percent: 35"
    },
    {
        "name": "تراكم الأرض 3",
        "buff": "يرتفع ضرر عنصر الأرض بمقدار عدد سجلات مهارات كلاين في نفس المجموعة × 10%.",
        "numbers": "earthDmg: 10"
    },
    {
        "name": "تحويل أكوا 5",
        "buff": "ضرر عنصر النار على الأعداء -15% وضرر عنصر الماء على الأعداء +30%.",
        "numbers": "waterDmg: 30, general_dmg: 30"
    },
    {
        "name": "المستشار التكتيكي 4",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات Yui في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الرماية 3",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات Sinon في نفس المجموعة، الهجوم +20%.* التطور والحد الأقصى من الاختراق",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "هالة 3",
        "buff": "الدفاع -30% وأثناء تأثير التعزيز لزيادة الحد الأقصى من الصحة معدل الإصابة -30%",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "القطع المشدد 3",
        "buff": "يرتفع الضرر الذي يلحق بضعف عناصر القطع بمقدار عدد سجلات مهارات Eydis في نفس المجموعة × 20%.",
        "numbers": "slashDmg: 20"
    },
    {
        "name": "إزهار كامل 3",
        "buff": "عند تجهيز 4 أو أكثر من سجلات مهارات Eydis في نفس المجموعة، قم بالهجوم +800.",
        "numbers": "flat_atk: 800"
    },
    {
        "name": "خسارة الشحن 1",
        "buff": "عندما يكون الدفاع -30% والصحة أقل من 50%، يكون الضرر -1000% للأعداء الذين لا يتحملون الدفع.* التطور والحد الأقصى من الاختراق",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "شفط الأرض 3",
        "buff": "عندما يكون اللاعب في حالة مرضية (سم)، الهجوم +35%./â—[تعزيز الترياق 3] ضرر السم -30%.",
        "numbers": "atk_percent: 35"
    },
    {
        "name": "ملك السيف 3",
        "buff": "قم بالهجوم +1000 عند استخدام سيف ذو ساعة واحدة.",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "تحويل الرياح 5",
        "buff": "ضرر عنصر الأرض على الأعداء -15% وضرر عنصر الرياح على الأعداء +30%.",
        "numbers": "windDmg: 30, general_dmg: 30"
    },
    {
        "name": "المبارز الأسود 3",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، الهجوم +20%.* التطور والحد الأقصى من الاختراق",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "سوبر تعزيز الشفاء",
        "buff": "تأثير أدوات الشفاء والأشياء الميدانية +100%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الذروة 3",
        "buff": "الهجوم +40% عندما تزيد الصحة عن 80%.",
        "numbers": "atk_percent: 40"
    },
    {
        "name": "صديق أجنبي 2",
        "buff": "يزيد الهجوم بمقدار 250 ضعف عدد سجلات مهارة المطر في نفس المجموعة.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "شفرة حادة 4",
        "buff": "يرتفع الهجوم بنسبة 6% × عدد سجلات مهارات Asuna في نفس المجموعة.",
        "numbers": "atk_percent: 6"
    },
    {
        "name": "تعويض الأرض 2",
        "buff": "عندما تتسمم، ضرر عنصر الأرض +35%.",
        "numbers": "earthDmg: 35, general_dmg: 35"
    },
    {
        "name": "عداد الحرق 3",
        "buff": "عندما يكون اللاعب في حالة مرضية (حرق)، الهجوم +1000./â—[تعزيز مناعة الحرق 2] ضرر الحرق -10%.",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "سبايشوليك 3",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات كيريتو في نفس المجموعة، الهجوم +20%.* التطور والحد الأقصى من الاختراق",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "تسريع الشفاء 4",
        "buff": "يستعيد بحد أقصى 4% من الصحة في 3 ثوانٍ.",
        "numbers": "hp_regen: 4"
    },
    {
        "name": "تحويل الأرض 5",
        "buff": "ضرر عنصر الرياح على الأعداء -15% وضرر عنصر الأرض على الأعداء +30%.",
        "numbers": "earthDmg: 30, general_dmg: 30"
    },
    {
        "name": "شيطان السيف 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Asuna في نفس المجموعة، الهجوم +20%* يتطور والحد الأقصى من الاختراق",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "العبها عن طريق الأذن 5",
        "buff": "الهجوم +25% عندما تكون الصحة أعلى من 50%، والدفاع +15% عندما تكون الصحة أقل من 50%.",
        "numbers": "atk_percent: 25, def_percent: 15"
    },
    {
        "name": "معركة دامية القطع 4",
        "buff": "الهجوم +40% عند الهجوم بعنصر الشرطة المائلة.",
        "numbers": "atk_percent: 40"
    },
    {
        "name": "السحب 3",
        "buff": "عند تجهيز 4 أو أكثر من سجلات مهارات Kirito في نفس المجموعة، قم بالهجوم +300",
        "numbers": "flat_atk: 300"
    },
    {
        "name": "شفط الصقيع 4",
        "buff": "عندما يصاب اللاعب بمرض الحالة (قضمة الصقيع)، الهجوم +50%./â—[تعزيز قضمة الصقيع 3] ضرر قضمة الصقيع -30%.",
        "numbers": "atk_percent: 50"
    },
    {
        "name": "رباطة جأش 3",
        "buff": "معدل الإصابة +30% عندما تصاب بقضمة الصقيع.",
        "numbers": "hit_rate: 30"
    },
    {
        "name": "رنين الجليد 4",
        "buff": "ضرر عنصر الماء +30% للأعداء الذين لديهم تأثير برتقالي.",
        "numbers": "waterDmg: 30, general_dmg: 30"
    },
    {
        "name": "تحويل الظلام 5",
        "buff": "ضرر العنصر المقدس على الأعداء -15% وضرر العنصر الداكن على الأعداء +30%.",
        "numbers": "darkDmg: 30, general_dmg: 30"
    },
    {
        "name": "تعويض الظل 2",
        "buff": "عندما تتعرض للعنة، ضرر العنصر المظلم +35%.",
        "numbers": "darkDmg: 35, general_dmg: 35"
    },
    {
        "name": "عداد النزيف 3",
        "buff": "عندما يكون اللاعب في حالة مرضية (نزيف)، الهجوم +1000./â—[تعزيز التخثر 2] ضرر النزيف -10%.",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "عداد النزيف 4",
        "buff": "عندما يكون اللاعب في حالة مرضية (نزيف)، الهجوم +1500.",
        "numbers": "flat_atk: 1500"
    },
    {
        "name": "تعويض الرياح 3",
        "buff": "عندما يصاب اللاعب بمرض الحالة (نزيف)، يكون ضرر عنصر الرياح +40%.",
        "numbers": "windDmg: 40, general_dmg: 40"
    },
    {
        "name": "كسر السد 3",
        "buff": "كمية مقياس الكسر +30% على الأعداء.",
        "numbers": "break_pct: 30"
    },
    {
        "name": "تراكم الظلام 3",
        "buff": "يرتفع ضرر العنصر الداكن بمقدار عدد سجلات مهارات سانيا في نفس المجموعة × 10%.",
        "numbers": "darkDmg: 10"
    },
    {
        "name": "ضربة المعركة الدموية 4",
        "buff": "الهجوم +40% عند الهجوم بعنصر حاد.",
        "numbers": "atk_percent: 40"
    },
    {
        "name": "تراكم اللهب 3",
        "buff": "يزداد ضرر عنصر النار بمقدار عدد سجلات مهارات Asuna في نفس المجموعة × 10%.",
        "numbers": "fireDmg: 10"
    },
    {
        "name": "ضربة حارقة 5",
        "buff": "الهجوم على الأعداء المحروقين يزيد بنسبة 30%.",
        "numbers": "general_dmg: 30"
    },
    {
        "name": "تحويل اللهب 5",
        "buff": "ضرر عنصر الماء على الأعداء -15% وضرر عنصر النار على الأعداء +30%.",
        "numbers": "fireDmg: 30, general_dmg: 30"
    },
    {
        "name": "الفنان القتالي 3",
        "buff": "عند تجهيز 2 أو أكثر من سجلات مهارات Leafa في نفس المجموعة، الهجوم +20%.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الهجوم 1",
        "buff": "الهجوم +25%.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "اقتحام المعركة الدموية 3",
        "buff": "الهجوم +35% عند الهجوم بعنصر الدفع.",
        "numbers": "atk_percent: 35"
    },
    {
        "name": "نار الجحيم 4",
        "buff": "يرتفع الهجوم بنسبة 7% × عدد سجلات مهارات كيريتو في نفس المجموعة.",
        "numbers": "atk_percent: 7"
    },
    {
        "name": "تزدهر 5",
        "buff": "الهجوم +25% عندما تزيد الصحة عن 50%.",
        "numbers": "atk_percent: 25"
    },
    {
        "name": "بيرس 4",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف بالنسبة للدفع بنسبة +25%.",
        "numbers": "thrustDmg: 25, general_dmg: 25"
    },
    {
        "name": "رباطة جأش 1",
        "buff": "معدل الإصابة +10% عندما تتعرض لقضمة الصقيع./â—[تعزيز قضمة الصقيع 2] ضرر قضمة الصقيع -10%.",
        "numbers": "hit_rate: 10"
    },
    {
        "name": "تراكم الصقيع 4",
        "buff": "يرتفع ضرر عنصر الماء بمقدار عدد سجلات مهارة Eydis في نفس المجموعة × 12.5%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تقنية السيف المتقدمة 3",
        "buff": "الضرر غير العنصري +25% عند استخدام سيف ذو حدين.",
        "numbers": "general_dmg: 25"
    },
    {
        "name": "شفط الهواء 4",
        "buff": "عندما يكون اللاعب في حالة مرضية (نزيف)، الهجوم +50%./â—[تعزيز التخثر 3] ضرر النزيف -30%.",
        "numbers": "atk_percent: 50"
    },
    {
        "name": "هدير العاصفة 4",
        "buff": "يسبب +15% من ضرر عنصر الرياح للعدو.",
        "numbers": "windDmg: 15"
    },
    {
        "name": "مكافحة السموم 4",
        "buff": "عندما يكون اللاعب مصابًا بمرض الحالة (السم)، يكون الهجوم +1500.",
        "numbers": "flat_atk: 1500"
    },
    {
        "name": "المنتصف 4",
        "buff": "الضرر الذي يلحق بالأعداء ضعيف لدرجة القطع +25%.",
        "numbers": "slashDmg: 25, general_dmg: 25"
    },
    {
        "name": "مكافحة قضمة الصقيع 4",
        "buff": "عندما يكون اللاعب في حالة مرضية (قضمة الصقيع)، يكون الهجوم +1500.",
        "numbers": "flat_atk: 1500"
    },
    {
        "name": "تراكم الحرارة 4",
        "buff": "يزداد ضرر عنصر النار بمقدار عدد سجلات مهارات Asuna في نفس المجموعة × 12.5%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "الفرصة الذهبية 4",
        "buff": "ضرر جسيم +50%.",
        "numbers": "crit_dmg: 50, general_dmg: 50"
    },
    {
        "name": "ثقب الطفرة 3",
        "buff": "يرتفع الضرر الذي يلحق بضعف عنصر الدفع بعدد سجلات مهارات LLENN في نفس المجموعة × 20%.",
        "numbers": "thrustDmg: 20"
    },
    {
        "name": "سايبر مايند 2",
        "buff": "يرتفع الهجوم بنسبة 7% × عدد سجلات مهارات Yui في نفس المجموعة.",
        "numbers": "atk_percent: 7"
    },
    {
        "name": "هجوم السيف المقدس",
        "buff": "يرتفع الهجوم بنسبة 10% × عدد سجلات مهارات هيثكليف في نفس المجموعة.",
        "numbers": "atk_percent: 10"
    },
    {
        "name": "الحصار1",
        "buff": "تنخفض جميع أضرار العناصر بنسبة 100% × عدد سجلات مهارات Asuna في نفس المجموعة (بما في ذلك العناصر غير العنصرية).",
        "numbers": "fireDmg: -100, waterDmg: -100, windDmg: -100, earthDmg: -100, holyDmg: -100, darkDmg: -100, noneDmg: -100"
    },
    {
        "name": "رد فعل ملحوظ",
        "buff": "معدل التهرب +16%. *لن يتم تفعيله بالهجوم البؤري.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "اقتحام المعركة الدموية 4",
        "buff": "الهجوم +40% عند الهجوم بعنصر الدفع.",
        "numbers": "atk_percent: 40"
    },
    {
        "name": "الشجاعة 3",
        "buff": "عند تجهيز 3 أو أكثر من سجلات مهارات Yui في نفس المجموعة، قم بالهجوم +300",
        "numbers": "flat_atk: 300"
    },
    {
        "name": "الإيمان الأعمى",
        "buff": "يرتفع الهجوم بنسبة 7% × عدد سجلات مهارات يونا في نفس المجموعة.",
        "numbers": "atk_percent: 7"
    },
    {
        "name": "الطفرة الصادمة 2",
        "buff": "يرتفع الضرر الذي يلحق بضعف العناصر الحادة بمقدار عدد سجلات مهارات Agil في نفس المجموعة × 8%.",
        "numbers": "bluntDmg: 8"
    },
    {
        "name": "النخبة التجارية 4",
        "buff": "عند تجهيز 5 أو أكثر من سجلات مهارات Agil في نفس المجموعة، قم بالهجوم +1000.",
        "numbers": "flat_atk: 1000"
    },
    {
        "name": "شفط الأرض 4",
        "buff": "عندما يكون اللاعب في حالة مرضية (سم)، الهجوم +50%./â—[تعزيز الترياق 3] ضرر السم -30%.",
        "numbers": "atk_percent: 50"
    },
    {
        "name": "نبض الأرض 4",
        "buff": "يسبب +15% من ضرر عنصر الأرض للعدو.",
        "numbers": "earthDmg: 15"
    },
    {
        "name": "تحويل اللمعان 5",
        "buff": "ضرر العنصر الداكن على الأعداء -15% وضرر العنصر المقدس على الأعداء +30%.",
        "numbers": "holyDmg: 30, general_dmg: 30"
    },
    {
        "name": "المزيد ديبان 4",
        "buff": "عند تجهيز 1 أو أكثر من سجلات مهارات Silica في نفس المجموعة، الهجوم +20%",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "الآس الخناجر 4",
        "buff": "الهجوم +40% عند استخدام الخناجر.",
        "numbers": "atk_percent: 40"
    },
    {
        "name": "الصديق الوفي 2",
        "buff": "يرتفع الهجوم بنسبة 7% × عدد سجلات مهارات سانيا في نفس المجموعة.",
        "numbers": "atk_percent: 7"
    },
    {
        "name": "تعزيز الدقة الصاعقة. 3",
        "buff": "â— مقاومة الصعق +30%.",
        "numbers": "stunRes: 30"
    },
    {
        "name": "تعزيز الدقة الدقة. 3",
        "buff": "â— مقاومة الضعف +30%",
        "numbers": "debilityRes: 30"
    },
    {
        "name": "تعويض الجليد 2",
        "buff": "عندما تصاب بقضمة الصقيع، ضرر عنصر الماء +35%.",
        "numbers": "waterDmg: 35, general_dmg: 35"
    },
    {
        "name": "الهجوم الأمامي 5",
        "buff": "زيادة العدوانية بنسبة -50% عند وقوع الهجوم.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "المودة العميقة 4",
        "buff": "يرتفع الدفاع بنسبة 4% × عدد سجلات مهارات Asuna في نفس المجموعة. ويرتفع الهجوم بنسبة 7% × عدد سجلات مهارات Leafa في نفس المجموعة.",
        "numbers": "def_percent: 4, atk_percent: 7"
    },
    {
        "name": "تراكم اللمعان 3",
        "buff": "يزداد ضرر العنصر المقدس بمقدار عدد سجلات مهارات سينون في نفس المجموعة × 10%.",
        "numbers": "holyDmg: 10"
    },
    {
        "name": "التناقض 3",
        "buff": "الهجوم +20% عند عدم تجهيز سجلات مهارات هيثكليف في نفس المجموعة.",
        "numbers": "atk_percent: 20"
    },
    {
        "name": "حماية النصل المقدس",
        "buff": "يرتفع الدفاع بنسبة 5% × عدد سجلات مهارات هيثكليف في نفس المجموعة.",
        "numbers": "def_percent: 5"
    },
    {
        "name": "تقليل جروح المعركة 5",
        "buff": "يقلل الضرر الناتج عن وحوش القطع والدفع والعناصر الحادة وأضرار الحالة المرضية بنسبة 5%.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "أكوا بوست 5",
        "buff": "ضرر العناصر بخلاف الماء الذي يلحق بالأعداء -50% (بما في ذلك العناصر غير العنصرية)، وضرر عنصر الماء على الأعداء +45%.",
        "numbers": "fireDmg: -50, windDmg: -50, earthDmg: -50, holyDmg: -50, darkDmg: -50, noneDmg: -50, waterDmg: 45, general_dmg: 45"
    },
    {
        "name": "تعزيز حرق ضرب 5",
        "buff": "â— + معدل النجاح للحرق.",
        "numbers": "No Stats Parsed"
    },
    {
        "name": "تحسين عنصر النار 4/برتقالي",
        "buff": "ضرر عنصر النار +9.00% لمدة 15 ثانية.",
        "numbers": "fireDmg: 9"
    },
    {
        "name": "علامة صغيرة/ديبوف",
        "buff": "الهجوم التالي الذي يتلقاه العدو سوف يسبب ضررًا بمقدار 1.5 مرة.",
        "numbers": "general_dmg: 50"
    },
    {
        "name": "قوة اللهب 4/برتقالي",
        "buff": "ضرر عنصر النار +15.00% لمدة 15 ثانية.",
        "numbers": "fireDmg: 15"
    },
    {
        "name": "تحسين العنصر الداكن 4/برتقالي",
        "buff": "ضرر العنصر الداكن +9.00% لمدة 15 ثانية.",
        "numbers": "darkDmg: 9"
    }
];
