const ACTIVE_EVENTS_AUTO = [
  {
    "type": "EVENT",
    "title": "[8/13 13:00 (JST/UTC+9) تحديث] تمت إضافة عناصر جديدة إلى المتداول! حدث الصيد \"Wild Squeezer Hunt\" هنا! يمكنك الحصول على الكثير من Memoria Niter للحد من كسر سجلات المهارات، بالإضافة إلى مواد التحويل والتحسين!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260723be.png",
    "startTime": "2026-07-22T19:00:00+00:00",
    "endTime": "2026-08-12T19:00:00+00:00",
    "snippet": "[8/13 13:00 (JST/UTC+9) تحديث] تمت إضافة العناصر إلى المتداول. استبدل \"لوحة العصارة الحمراء\" بالعناصر المضافة.  العناصر المضافة قائمة العناصر القابلة للتداول المبلغ المطلوب حد التجارة Memoria Niter S10040 إطار السجل L650 حجر التنين الوهج 625 الجرعة التصالحية 325 جرعة الحياة 95 كريستال الطوارئ 310 ينظف...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5396.html"
  },
  {
    "type": "EVENT",
    "title": "[8/5 14:00 (JST/UTC+9) تحديث] تمت إضافة مكافآت وصعوبة عالية! لقد وصل حدث الصيد \"Wild Squeezer Hunt\"! يمكنك الحصول على الكثير من Memoria Niter للحد من كسر سجلات المهارات، بالإضافة إلى مواد التحويل والتحسين!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260723be.png",
    "startTime": "2026-07-22T19:00:00+00:00",
    "endTime": "2026-08-12T19:00:00+00:00",
    "snippet": "[8/5 14:00 (JST/UTC+9) تحديث] تمت إضافة الزنزانة شديدة الصعوبة \"Abyss\" والعناصر أثناء صيانة 5 أغسطس 2026 (الأربعاء).  زنزانة عالية الصعوبة، تمت إضافة \"Abyss\" إلى هذه منطقة ذات إعاقة كريستالية حيث لا يمكن استخدام Revive Crystals. الطاقة الإجمالية الموصى بها هي 600000. يمكنك إكمال...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5381.html"
  },
  {
    "type": "EVENT",
    "title": "احصل على الفستان الأبيض النقي وختم محدود الإصدار! \"استكشف الزنزانة مع Yui\" هنا!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260801yui.png",
    "startTime": "2026-07-31T15:00:00+00:00",
    "endTime": "2026-08-12T19:00:00+00:00",
    "snippet": "\"استكشف الزنزانة مع Yui\" هنا للاحتفال بعيد ميلاد Yui. يمكنك الاستمتاع بالتقدم عبر الزنزانة مع Yui أثناء هذا الحدث. الزنزانة الموجودة في هذا الحدث هي زنزانة مرتفعة تساعدك أنت والشخصيات المساعدة على النمو بشكل أقوى.  المكافآت: احصل على الصورة الرمزية للثوب الأبيض النقي...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5361.html"
  },
  {
    "type": "EVENT",
    "title": "حدث الصيد \"Wild Squeezer Hunt\" هنا! يمكنك الحصول على الكثير من Memoria Niter للحد من كسر سجلات المهارات، بالإضافة إلى مواد التحويل والتحسين!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260723be.png",
    "startTime": "2026-07-22T19:00:00+00:00",
    "endTime": "2026-08-12T19:00:00+00:00",
    "snippet": "[تم التحديث: 31/07 13:35] لقد أكدنا مشكلة تتمثل في عدم عرض الزنزانات عالية الصعوبة ومكافآت المتداولين، والتي كان من المقرر إضافتها بعد الصيانة يوم 29/7 (الأربعاء)، بشكل صحيح.  ونتيجة لذلك، تم تأجيل إصدار هذا المحتوى حتى الصيانة يوم 8/5 (الأربعاء). في ...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5344.html"
  },
  {
    "type": "EVENT",
    "title": "[7/29 14:00 (JST/UTC+9) تحديث] تمت إضافة المكافآت والصعوبة العالية! لقد وصل حدث الصيد \"Wild Squeezer Hunt\"! يمكنك الحصول على الكثير من Memoria Niter للحد من كسر سجلات المهارات، بالإضافة إلى مواد التحويل والتحسين!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260723be.png",
    "startTime": "2026-07-22T19:00:00+00:00",
    "endTime": "2026-08-12T19:00:00+00:00",
    "snippet": "[7/29 14:00 (JST/UTC+9) تحديث] تمت إضافة الزنزانة شديدة الصعوبة \"Abyss\" والعناصر أثناء صيانة 29 يوليو 2026 (الأربعاء).  زنزانة عالية الصعوبة، تمت إضافة \"Abyss\" إلى هذه منطقة ذات إعاقة كريستالية حيث لا يمكن استخدام Revive Crystals. الطاقة الإجمالية الموصى بها هي 600000. يمكنك إكمال...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5358.html"
  },
  {
    "type": "Campaign",
    "title": "لقد وصلت \"حملة إنتاج الخاتم\"! انخفضت تكاليف الإنتاج إلى النصف وزادت مكافآت المعركة!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20230426yubi.png",
    "startTime": "2026-07-28T19:00:00+00:00",
    "endTime": "2026-08-12T19:00:00+00:00",
    "snippet": "\"حملة إنتاج الخاتم\" هنا.  خلال الحملة، انخفضت تكاليف إنتاج \"الخواتم\" و\"Ring Gemstone+\" إلى النصف! بالإضافة إلى ذلك، ستحصل على \"أحجار كريمة حلقية\" أكثر من المعتاد من مكافآت معركة \"LafCof Phantoms & the Ring Gem Temple\"! اغتنم هذه الفرصة لإنتاج الكثير من الحلقات!  مدة الحملة...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5359.html"
  },
  {
    "type": "EVENT",
    "title": "【رفع الزنزانة】\"Leaf's Limit Break Dojo\" متاح الآن! احصل على أكوام من Memoria Niter S للحد من كسر سجلات المهارات الخاصة بك!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20230125ri.png",
    "startTime": "2026-08-06T19:00:00+00:00",
    "endTime": "2026-08-13T18:59:00+00:00",
    "snippet": "The Raising Dungeon موجود هنا للمساعدة في تعزيز نمو الشخصية!  تحدي Leafa في \"Memoria Dojo\" واحصل على أكوام من \"Memoria Niter S\"، المادة اللازمة لتحطيم الأرقام القياسية للمهارات! سيبدأ \"Leaf's Limit Break Dojo\".   يمكنك أيضًا تحدي لعبة \"Serious Match Memoria Do\" الصعبة للغاية...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5385.html"
  },
  {
    "type": "EVENT",
    "title": "\"جولات متعددة: 2x تجربة حملة مهمة الشخصية\" هنا!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20220427cq.png",
    "startTime": "2026-08-12T19:00:00+00:00",
    "endTime": "2026-08-18T19:00:00+00:00",
    "snippet": "خلال هذه الحملة، احصل على خبرة مضاعفة في مهام الشخصيات ذات الجولات المتعددة! هذه هي فرصتك لرفع مستوى لاعبك بسهولة!  بداية الحدث اقبل مهمة الشخصية من لوحة الإعلانات في منطقة التجار.  متطلبات المشاركة أكمل المهمة الرئيسية ط1 حتى نهاية الحملة...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5393.html"
  },
  {
    "type": "EVENT",
    "title": "قم بالوصول إلى تصنيف SSS بإجمالي 5000 جوهرة أركانا! \"تحدي معركة النقابة ضد كوبولد لورد\" هنا!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260805gbc.png",
    "startTime": "2026-08-04T19:00:00+00:00",
    "endTime": "2026-08-18T19:00:00+00:00",
    "snippet": "الحدث الجديد \"تحدي معركة النقابة ضد كوبولد لورد\" أصبح هنا! واجه زنزانات مداهمة صعبة مع نقابتك بأكملها واهدف إلى الحصول على أعلى رتبة!  احصل على 1000 جوهرة أركانا في رتبة S، و1500 في رتبة SS، و2500 في رتبة SSS من الإنجازات! إذا وصلت إلى تصنيف SSS، يمكنك الحصول على إجمالي...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5377.html"
  },
  {
    "type": "EVENT",
    "title": "\"ذعر البطيخ!\" عاد! احصل على الصورة الرمزية لملابس السباحة!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260630su.png",
    "startTime": "2026-06-29T19:00:00+00:00",
    "endTime": "2026-08-25T19:00:00+00:00",
    "snippet": "حدث السيناريو \"ذعر البطيخ!\" عاد!  سيحمل هذا الحدث التقدم التالي من الجولة السابقة: ・تقدم المهام والمكافآت ・إجمالي النقاط ومكافآت النقاط ・مكافآت التحدي ・المبلغ المتداول ・الإنجازات والتقدم في الإنجاز ذعر البطيخ! شاطئ جميل بجوار...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5302.html"
  },
  {
    "type": "EVENT",
    "title": "لقد عادت لعبة \"مخيفة بعض الشيء؟! استكشاف الكهف\"! احصل على [ملابس الصيف] ليسبيث!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260630cho.png",
    "startTime": "2026-06-29T19:00:00+00:00",
    "endTime": "2026-08-25T19:00:00+00:00",
    "snippet": "لقد عاد حدث السيناريو \"مخيف بعض الشيء؟! استكشاف الكهف\"!  سيحمل هذا الحدث التقدم التالي من الجولة السابقة: ・تقدم المهام والمكافآت ・إجمالي النقاط ومكافآت النقاط ・مكافآت التحدي ・المبلغ المتداول ・الإنجازات والتقدم في الإنجاز مخيف بعض الشيء؟! رحلة استكشاف الكهف...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5303.html"
  },
  {
    "type": "EVENT",
    "title": "[8/13 13:00 (JST/UTC+9) تحديث] تمت إضافة عناصر جديدة إلى المتداول! حدث السيناريو \"العملية: ذكريات الصيف\" قيد التنفيذ الآن! احصل على 4 سجل مهارات Sasha وطوابع محدودة الإصدار والمزيد!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260724se.png",
    "startTime": "2026-07-28T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "[8/13 13:00 (JST/UTC+9) تحديث] تمت إضافة العناصر إلى المتداول. استبدل \"إغراء الحنين الأزرق\" بالعناصر المضافة.  العناصر المضافة قائمة العناصر القابلة للتداول المبلغ المطلوب حد التجارة ميموريا نيتر S10025 الجرعة التصالحية 350 كريستال الطوارئ 95 جرعة التطهير 920 إحياء الكريستال 1010 إطار السجل L920 Gla ...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5395.html"
  },
  {
    "type": "EVENT",
    "title": "[8/13 13:00 (JST/UTC+9) تحديث] تمت إضافة مكافآت وصعوبة عالية! مهرجان Agil الصيفي 2026 -Tuna Wars!- بدأ! احصل على 4 سجل مهارات Agil وصورة رمزية للأسلحة تحمل طابع الأسماك!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260805ag.png",
    "startTime": "2026-08-04T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "[8/13 13:00 (JST/UTC+9) تحديث] تمت إضافة الزنزانة شديدة الصعوبة \"Abyss\" والعناصر أثناء صيانة 13 أغسطس 2026 (الخميس).  زنزانة عالية الصعوبة، تمت إضافة \"Abyss\" إلى هذا \"حقل به بعض العناصر غير القابلة للاستخدام\" حيث لا يمكن استخدام عناصر معينة ولا يمكن للاعبين إحيائها. التوتا الموصى بها...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5394.html"
  },
  {
    "type": "EVENT",
    "title": "مهرجان أجيل الصيفي 2026 -حروب التونة!- بدأ! احصل على 4 سجل مهارات Agil وصورة رمزية للأسلحة تحمل طابع الأسماك!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260805ag.png",
    "startTime": "2026-08-04T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "قتال إلى جانب أجيل وهزيمة الوحوش على الشاطئ!  المكافآت احصل على ما يصل إلى 500 \"Arcana Gems\"، وما يصل إلى 500 \"Memoria Niter S\"، وما يصل إلى 20 \"ميدالية للفنون القتالية\"، وما يصل إلى 100 \"Awakening Stars\"، وما يصل إلى 20 من \"الجواهر العظيمة\". 300 جوهرة أركانا تأتي من الزنزانات، والباقي من التاجر...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5378.html"
  },
  {
    "type": "EVENT",
    "title": "حدث تصنيف الصيد، \"مسابقة صيد الأسماك في منتصف الصيف لعام 2026\" هنا!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260805fe.png",
    "startTime": "2026-08-04T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "حدث تصنيف الصيد \"مسابقة صيد الأسماك في منتصف الصيف لعام 2026\" قائم الآن. في \"مسابقة صيد الأسماك في منتصف الصيف لعام 2026\"، ستتنافس للحصول على أفضل تصنيف بناءً على نتائج صيدك.  يظهر Bubbly Bonito وLace Wraith، المحددان من عمليات إرسال المستخدم، على خريطة الحدث هذه! القبض عليهم للحصول على درجة عالية!  بو...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5376.html"
  },
  {
    "type": "EVENT",
    "title": "[8/5 13:00 (JST/UTC+9) تحديث] تمت إضافة مكافآت وصعوبة عالية! حدث السيناريو \"العملية: ذكريات الصيف\" قيد التنفيذ الآن! احصل على 4 سجل مهارات Sasha وطوابع محدودة الإصدار والمزيد!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260724se.png",
    "startTime": "2026-07-28T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "[8/5 13:00 (JST/UTC+9) تحديث] تمت إضافة الزنزانة شديدة الصعوبة \"المنفى\" والعناصر أثناء صيانة 5 أغسطس 2026 (الأربعاء).  زنزانة عالية الصعوبة، تمت إضافة \"المنفى\" إلى هذا \"حقل به بعض العناصر غير القابلة للاستخدام\" حيث لا يمكن استخدام عناصر معينة ولا يمكن للاعبين إحيائها. المجموع الموصى به...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5380.html"
  },
  {
    "type": "EVENT",
    "title": "لقد عادت \"عملية اختبار كلاين للشجاعة\"!  احصل على تجسدات الأشباح!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260805k.png",
    "startTime": "2026-08-04T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "لقد عاد حدث السيناريو \"اختبار كلاين لعملية الشجاعة\"!  سيحمل هذا الحدث التقدم التالي من الجولة السابقة: ・تقدم المهمة والمكافآت ・إجمالي النقاط ومكافآت النتيجة ・مكافآت التحدي ・المبلغ المتداول ・الإنجازات والتقدم في الإنجاز اختبار كلاين للشجاعة...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5383.html"
  },
  {
    "type": "EVENT",
    "title": "حدث السيناريو \"العملية: ذكريات الصيف\" بدأ الآن! احصل على 4 سجل مهارات Sasha وطوابع محدودة الإصدار والمزيد!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260724se.png",
    "startTime": "2026-07-28T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "حدث السيناريو \"العملية: ذكريات الصيف\" بدأ الآن!  نظمت ساشا رحلة لمنح أطفال دار الأيتام فرصة تجربة العطلة الصيفية. يستعيد الجميع، جنبًا إلى جنب مع الأطفال، متعة الصيف من خلال صيد الأسماك واصطياد الحشرات ولعب الغميضة، تمامًا مثل الصيف الذي كانوا يعيشونه من قبل...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5357.html"
  },
  {
    "type": "EVENT",
    "title": "حدث السيناريو تسخين الشاطئ! لقد عادت ملابس السباحة الصيفية المذهلة! احصل على 4 سجل مهارات السيليكا وطوابع الدردشة ذات الإصدار المحدود!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20250724se.png",
    "startTime": "2026-07-22T19:00:00+00:00",
    "endTime": "2026-08-26T19:00:00+00:00",
    "snippet": "لقد عاد حدث السيناريو \"Heat the Beach!: Ultimate Swimsuit الحلقة\"!  سيحمل هذا الحدث التقدم التالي من الجولة السابقة: ・تقدم المهام والمكافآت ・إجمالي النقاط ومكافآت النقاط ・مكافآت التحدي ・المبلغ المتداول ・الإنجازات والتقدم في الإنجازات تتولى البطلات...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5347.html"
  },
  {
    "type": "EVENT",
    "title": "لقد عادت \"الإرادة الفولاذية للقبض على الملك\"! ★4 عادت سجلات مهارة ملابس السباحة أليس!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260715tu.png",
    "startTime": "2026-07-14T19:00:00+00:00",
    "endTime": "2026-09-01T19:00:00+00:00",
    "snippet": "لقد عاد حدث السيناريو \"الإرادة الفولاذية للقبض على الملك\"!  سيحمل هذا الحدث التقدم التالي من الجولة السابقة: ・تقدم المهام والمكافآت ・إجمالي النقاط ومكافآت النقاط ・مكافآت التحدي ・المبلغ المتداول ・الإنجازات وتقدم الإنجاز Will of Steel to Catch the K...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5331.html"
  },
  {
    "type": "EVENT",
    "title": "انطلق في مغامرة في وضع لعبة الموت مع أصداء البقاء: أصداء احتفال افتتاح Aincrad!",
    "image": "https://saoif-com.akamaized.net/web/shop_login/en/img/other/20260624es.png",
    "startTime": "2026-06-23T19:00:00+00:00",
    "endTime": "2026-09-28T19:00:00+00:00",
    "snippet": "للاحتفال بالإطلاق القادم لأحدث لعبة من سلسلة ألعاب Sword Art Online، سنعقد حدثًا خاصًا في SAOIF!  Echoes of Survival هو حدث يعيد إنشاء وضع لعبة Death Game الذي لا يرحم والذي سيتم تنفيذه في Echoes of Aincrad. الهزيمة لن تكون خيارا الدخول إلى منطقة قريبة...",
    "news_url": "https://saoif.nayu.fun/shop_information/detail/5288.html"
  }
];
